Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_SSARC_HP.h
/*
** ###################################################################
**     Processors:          MIMXRT1151DHM8B
**                          MIMXRT1151DVM8B
**                          MIMXRT1151XHM8B
**                          MIMXRT1151XVM8B
**                          MIMXRT1152AHM6B
**                          MIMXRT1152AVM6B
**                          MIMXRT1152DHM8B
**                          MIMXRT1152DVM8B
**                          MIMXRT1152XHM8B
**                          MIMXRT1152XVM8B
**
**     Version:             rev. 0.2, 2026-02-26
**     Build:               b260622
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SSARC_HP
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2026-01-09)
**         Initial version.
**     - rev. 0.2 (2026-02-26)
**         Update header file based on RM Rev1.
**
** ###################################################################
*/

/*!
 * @file PERI_SSARC_HP.h
 * @version 0.2
 * @date 2026-02-26
 * @brief CMSIS Peripheral Access Layer for SSARC_HP
 *
 * CMSIS Peripheral Access Layer for SSARC_HP
 */

#if !defined(PERI_SSARC_HP_H_)
#define PERI_SSARC_HP_H_                         /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1151DHM8B) || defined(CPU_MIMXRT1151DVM8B) || defined(CPU_MIMXRT1151XHM8B) || defined(CPU_MIMXRT1151XVM8B))
#include "../MIMXRT1151_COMMON.h"
#elif (defined(CPU_MIMXRT1152AHM6B) || defined(CPU_MIMXRT1152AVM6B) || defined(CPU_MIMXRT1152DHM8B) || defined(CPU_MIMXRT1152DVM8B) || defined(CPU_MIMXRT1152XHM8B) || defined(CPU_MIMXRT1152XVM8B))
#include "../MIMXRT1152_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SSARC_HP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SSARC_HP_Peripheral_Access_Layer SSARC_HP Peripheral Access Layer
 * @{
 */

/** SSARC_HP - Size of Registers Arrays */
#define SSARC_HP_DESC_COUNT                       1024u

/** SSARC_HP - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x10 */
    __IO uint32_t SRAM0;                             /**< Description Address Register, array offset: 0x0, array step: 0x10 */
    __IO uint32_t SRAM1;                             /**< Description Data Register, array offset: 0x4, array step: 0x10 */
    __IO uint32_t SRAM2;                             /**< Description Control Register, array offset: 0x8, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } DESC[SSARC_HP_DESC_COUNT];
} SSARC_HP_Type;

/* ----------------------------------------------------------------------------
   -- SSARC_HP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SSARC_HP_Register_Masks SSARC_HP Register Masks
 * @{
 */

/*! @name SRAM0 - Description Address Register */
/*! @{ */

#define SSARC_HP_SRAM0_ADDR_MASK                 (0xFFFFFFFFU)
#define SSARC_HP_SRAM0_ADDR_SHIFT                (0U)
/*! ADDR - Address field */
#define SSARC_HP_SRAM0_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << SSARC_HP_SRAM0_ADDR_SHIFT)) & SSARC_HP_SRAM0_ADDR_MASK)
/*! @} */

/* The count of SSARC_HP_SRAM0 */
#define SSARC_HP_SRAM0_COUNT                     (1024U)

/*! @name SRAM1 - Description Data Register */
/*! @{ */

#define SSARC_HP_SRAM1_DATA_MASK                 (0xFFFFFFFFU)
#define SSARC_HP_SRAM1_DATA_SHIFT                (0U)
/*! DATA - Data field */
#define SSARC_HP_SRAM1_DATA(x)                   (((uint32_t)(((uint32_t)(x)) << SSARC_HP_SRAM1_DATA_SHIFT)) & SSARC_HP_SRAM1_DATA_MASK)
/*! @} */

/* The count of SSARC_HP_SRAM1 */
#define SSARC_HP_SRAM1_COUNT                     (1024U)

/*! @name SRAM2 - Description Control Register */
/*! @{ */

#define SSARC_HP_SRAM2_TYPE_MASK                 (0x7U)
#define SSARC_HP_SRAM2_TYPE_SHIFT                (0U)
/*! TYPE - Type field
 *  0b000..SR
 *  0b001..WO
 *  0b010..RMW_OR
 *  0b011..RMW_AND
 *  0b100..DELAY
 *  0b101..POLLING_0
 *  0b110..POLLING_1
 *  0b111..Reserved
 */
#define SSARC_HP_SRAM2_TYPE(x)                   (((uint32_t)(((uint32_t)(x)) << SSARC_HP_SRAM2_TYPE_SHIFT)) & SSARC_HP_SRAM2_TYPE_MASK)

#define SSARC_HP_SRAM2_SV_EN_MASK                (0x10U)
#define SSARC_HP_SRAM2_SV_EN_SHIFT               (4U)
/*! SV_EN - Save Enable
 *  0b0..Do not use this descriptor in the save operation
 *  0b1..Use this descriptor in the save operation
 */
#define SSARC_HP_SRAM2_SV_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SSARC_HP_SRAM2_SV_EN_SHIFT)) & SSARC_HP_SRAM2_SV_EN_MASK)

#define SSARC_HP_SRAM2_RT_EN_MASK                (0x20U)
#define SSARC_HP_SRAM2_RT_EN_SHIFT               (5U)
/*! RT_EN - Restore Enable
 *  0b0..Do not use this descriptor for the restore operation
 *  0b1..Use this descriptor for the restore operation
 */
#define SSARC_HP_SRAM2_RT_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SSARC_HP_SRAM2_RT_EN_SHIFT)) & SSARC_HP_SRAM2_RT_EN_MASK)

#define SSARC_HP_SRAM2_SIZE_MASK                 (0xC0U)
#define SSARC_HP_SRAM2_SIZE_SHIFT                (6U)
/*! SIZE - Size field
 *  0b00..8-bit
 *  0b01..16-bit
 *  0b10..32-bit
 *  0b11..Reserved
 */
#define SSARC_HP_SRAM2_SIZE(x)                   (((uint32_t)(((uint32_t)(x)) << SSARC_HP_SRAM2_SIZE_SHIFT)) & SSARC_HP_SRAM2_SIZE_MASK)
/*! @} */

/* The count of SSARC_HP_SRAM2 */
#define SSARC_HP_SRAM2_COUNT                     (1024U)


/*!
 * @}
 */ /* end of group SSARC_HP_Register_Masks */


/*!
 * @}
 */ /* end of group SSARC_HP_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SSARC_HP_H_ */

